* SPDX-License-Identifier: MIT
* Original selected short-form list/execute interface; README.md.
         MACRO
&N       CLOSE &DCBS,&MF=,&TYPE=
         AIF   ('&TYPE' NE '' AND '&TYPE' NE 'T').BAD
         AIF   ('&TYPE' EQ 'T').T
&N       MF$SHORT 20,&DCBS,&MF,HASMODE=NO
         MEXIT
.T       ANOP
&N       MF$SHORT 23,&DCBS,&MF,HASMODE=NO
         MEXIT
.BAD     MNOTE 8,'unsupported selected CLOSE template'
         MEND
