* SPDX-License-Identifier: MIT; original sparse classic SAM DCB map.
         MACRO
&N       DCBD &DSORG=,&DEVD=
         AIF   ('&N' NE '' OR '&DSORG' NE 'PS').BAD
         AIF   ('&DEVD' NE '(DA,TA)').BAD
IHADCB   DSECT
         DS    CL96
DCBBUFCA EQU   IHADCB+21,3,C'X'
DCBDSRG1 EQU   IHADCB+26,1,C'X'
DCBIOBAA EQU   IHADCB+29,3,C'X'
DCBEODA  EQU   IHADCB+33,3,C'X'
DCBRECFM EQU   IHADCB+36,1,C'X'
DCBEXLSA EQU   IHADCB+37,3,C'X'
DCBDDNAM EQU   IHADCB+40,8,C'C'
DCBTIOT  EQU   IHADCB+40,2,C'X'
DCBDEBAD EQU   IHADCB+44,4,C'A'
DCBIFLGS EQU   IHADCB+44,1,C'X'
DCBOFLGS EQU   IHADCB+48,1,C'X'
DCBMACR  EQU   IHADCB+50,2,C'X'
DCBOPTCD EQU   IHADCB+52,1,C'X'
DCBBLKSI EQU   IHADCB+62,2,C'X'
DCBLRECL EQU   IHADCB+82,2,C'X'
DCBBLKCT EQU   IHADCB+16,4,C'F'
DCBIOBA  EQU   IHADCB+68,4,C'A'
DCBDSGPO EQU   2
DCBIFEC  EQU   192
DCBMRRD  EQU   32
DCBMRWRT EQU   32
DCBOFLWR EQU   1
DCBOFOPN EQU   16
DCBOFPPC EQU   8
DCBRECF  EQU   128
DCBRECV  EQU   64
DCBRECU  EQU   192
DCBRECLA EQU   224
DCBRECTO EQU   32
DCBRECBR EQU   16
DCBRECSB EQU   8
         MEXIT
.BAD     MNOTE 8,'selected DCBD requires PS and (DA,TA)'
         MEND
