* SPDX-License-Identifier: MIT
* Original selected short-form list/execute interface; README.md.
         MACRO
&N       OPEN &DCBS,&MF=,&TYPE=
         AIF   ('&TYPE' NE '' AND '&TYPE' NE 'J').BAD
         AIF   ('&TYPE' EQ 'J').J
&N       MF$SHORT 19,&DCBS,&MF
         MEXIT
.J       ANOP
&N       MF$SHORT 22,&DCBS,&MF
         MEXIT
.BAD     MNOTE 8,'unsupported selected OPEN template'
         MEND
