* SPDX-License-Identifier: MIT
* Original SVC64 short-list entry; list/DCB/exit/JFCB must be below 16 MiB.
         MACRO
&N       RDJFCB &DCBS,&MF=
&N       MF$SHORT 64,&DCBS,&MF
         MEND
