* SPDX-License-Identifier: MIT
* Selected TSO/E GETLINE forms used by the maintained lean service profile.
* GTPB/IOPL fields: IBM TSO/E Programming Services, GETLINE and IOPL.
* SVC 6 LINK interface: IBM MVS Diagnosis Reference, z/OS V1R11.
         MACRO
&N       GETLINE &PARM=,&ECT=,&UPT=,&ECB=,&MF=
         AIF   ('&MF' EQ 'L').LIST
         AIF   (N'&MF NE 2).BAD
         AIF   ('&MF(1)' NE 'E' OR '&MF(2)' NE 'ZIOPL').BAD
         AIF   ('&PARM' NE 'ZGETLINE' OR '&ECT' NE '(R6)').BAD
         AIF   ('&UPT' NE '(R7)' OR '&ECB' NE 'ZIOECB').BAD
&N       DS    0H
         LA    R15,ZIOPL
         ST    R7,0(R15)
         ST    R6,4(R15)
         LA    R0,ZIOECB
         ST    R0,8(R15)
         LA    R0,ZGETLINE
         ST    R0,12(R15)
         LR    R1,R15
         L     R15,=A(MF$G&SYSNDX.L)
         SVC   6
         B     MF$G&SYSNDX.E
         DS    0F
MF$G&SYSNDX.L DC A(MF$G&SYSNDX.N),2F'0'
MF$G&SYSNDX.N DC CL8'IKJGETL'
MF$G&SYSNDX.E DS 0H
         MEXIT
.LIST    AIF   ('&PARM' NE '' OR '&ECT' NE '').BAD
         AIF   ('&UPT' NE '' OR '&ECB' NE '').BAD
         DS    0F
&N       DC    X'00008000',A(0)
         MEXIT
.BAD     MNOTE 8,'unsupported selected TSO GETLINE form'
         MEND
