* SPDX-License-Identifier: MIT
* Original selected 72-byte save-area interface. See README.md.
         MACRO
&N       SAVE &REG,&TRACE,&ID
         LCLA &LENGTH,&AFTER
         LCLC &STNAME
&STNAME  SETC '&N'
         AIF   ('&TRACE' NE '').BAD
         AIF   ('&REG' NE '(14,12)' AND '&REG' NE '(0,11)').BAD
         AIF   ('&ID' EQ '*').BAD
         AIF   ('&ID' EQ '').NOID
&LENGTH  SETA  K'&ID
         AIF   (&LENGTH GT 70).BAD
&AFTER   SETA  (5+&LENGTH+1)/2*2
&N       B     &AFTER.(,15)
         DC    AL1(&LENGTH)
         DC    C'&ID'
         DS    0H
&STNAME  SETC ''
         AGO   .STORE
.NOID    ANOP
.STORE   AIF   ('&REG' EQ '(0,11)').LOW
&STNAME  STM   14,12,12(13)
         MEXIT
.LOW     ANOP
&STNAME  STM   0,11,20(13)
         MEXIT
.BAD     MNOTE 8,'unsupported selected SAVE interface'
         MEND
