* SPDX-License-Identifier: MIT
* Original inline sparse 176-byte JFCB compatibility map; README.md.
         MACRO
&N       IEFJFCBN &LIST=YES
         AIF   ('&N' NE '' OR '&LIST' NE 'YES').BAD
         DS    0F
JFCBDSNM DS    CL44
INFMJFCB EQU   JFCBDSNM
         DS    CL56
JFCRECFM DS    C
         DS    C
JFCBLKSI DS    H
JFCLRECL DS    H
         DS    CL70
JFCBLGTH EQU   176
JFCBELNM EQU   JFCBDSNM+44,8,C'C'
JFCBTSDM EQU   JFCBDSNM+52,1,C'X'
JFCBIND1 EQU   JFCBDSNM+86,1,C'X'
JFCDSORG EQU   JFCBDSNM+98,2,C'X'
JFCDSRG1 EQU   JFCBDSNM+98,1,C'X'
JFCDSRG2 EQU   JFCBDSNM+99,1,C'X'
JFCBUFSI EQU   JFCBLKSI,2,C'X'
JFCNCP   EQU   JFCBDSNM+106,1,C'X'
JFCBVOLS EQU   JFCBDSNM+118,30,C'C'
JFCBVLCT EQU   JFCBDSNM+174,1,C'X'
JFCCAT   EQU   128
JFCVSL   EQU   64
JFCNWRIT EQU   8
JFCPDS   EQU   1
JFCORGPS EQU   64
JFCORGPO EQU   2
JFCORGAM EQU   8
         MEXIT
.BAD     MNOTE 8,'unsupported selected inline JFCB mapping'
         MEND
